erpdev.СХК_Расширение/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтруктураПредприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="efb55688-b3a2-4591-9180-b27e7384ef2c">
    <name>ПроизводственноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="693abaa8-7ead-40ef-b6c7-ac67745559a6">
    <name>УправлениеМаршрутнымиЛистами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02424494-31bb-446e-92a1-c4b908274c78">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0c7f4b0-ac15-4474-aa24-e843a59e54a2">
    <name>СпособПооперационногоУправления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2cba4b23-321f-4fd9-b529-c3dc3cae3989">
    <name>ТекущийРуководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9caf7b1-1b75-4af0-9762-76bbf3220b0d">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="da9b4a5a-6f75-4f53-b14e-43369876cefa">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e29ce393-e38f-4463-a0bb-232cf91f8ccb">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ef67acca-0067-4ccc-a5eb-9cd00bdd26a5">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="caa98e95-8c93-4d01-8b17-7bae25647116">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Enums/УправлениеМаршрутнымиЛистами/УправлениеМаршрутнымиЛистами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7cbbd1f1-162f-43d0-af8a-29c409dd6c85">
  <name>УправлениеМаршрутнымиЛистами</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f6766d70-c400-40d6-baf7-1b548a281f31">
    <name>ПооперационноеПланирование</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4749192-5aa3-43b6-9bbb-ec4ec686c08b">
    <name>МетодикаББВ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92d1f428-2bcc-4831-8a70-db3f7103593e">
    <name>РегистрацияОпераций</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a2782760-dd4c-44d2-a785-814d6f610455">
  <name>ГруппыПользователей</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6581ac1f-11ef-42b8-9f3b-590bb7546e63">
    <name>Состав</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ce952e88-35b7-4506-81ac-d7081e50a650">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Catalogs/СтруктураПредприятия/ObjectModule.bsl
&Вместо("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)
	
   ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	
   Админ = Справочники.ГруппыПользователей.НайтиПоНаименованию("Администраторы"); 

	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекПользователь);
	Строка = Админ.Состав.НайтиСтроки(Отбор);                               
	Если Строка.Количество()>=1 Тогда
		
	Иначе
		Сообщить("Нет разрешения для редактирования данного справочника");
		Возврат;		
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	//++ НЕ УТКА
	ИменаОпций = Новый Массив;
	ИменаОпций.Добавить("ИспользоватьПооперационноеУправление");
	ИменаОпций.Добавить("ИспользоватьПооперационноеПланирование");
	ИменаОпций.Добавить("ИспользоватьСменныеЗадания");
	
	//++ Устарело_Производство21
	ИменаОпций.Добавить("УправлениеМаршрутнымиЛистами");
	//-- Устарело_Производство21
	
	ЗначениеОпцийДоИзменения    = Новый Структура;
	ЗначениеОпцийПослеИзменения = Новый Структура;
	
	Для каждого ИмяОпции Из ИменаОпций Цикл
		ЗначениеОпцийПослеИзменения.Вставить(ИмяОпции, ЭтотОбъект[ИмяОпции]);
	КонецЦикла;
	//-- НЕ УТКА
	
	Если ЭтоНовый() Тогда
		
		ТекущаяСсылка = Справочники.СтруктураПредприятия.ПолучитьСсылку();
		УстановитьСсылкуНового(ТекущаяСсылка);
		
		//++ НЕ УТ
		ИзменилсяПризнакПроизводственное = ПроизводственноеПодразделение;
		//-- НЕ УТ
		
	Иначе
		
		//++ НЕ УТ
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("ПроизводственноеПодразделение", "ПроизводственноеПодразделение");
		//++ НЕ УТКА
		Реквизиты.Вставить("СпособПооперационногоУправления", "СпособПооперационногоУправления");
		
		Для каждого ИмяОпции Из ИменаОпций Цикл
			Реквизиты.Вставить(ИмяОпции);
		КонецЦикла;
		
		//-- НЕ УТКА
		
		РеквизитыДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
		
		ИзменилсяПризнакПроизводственное = РеквизитыДоЗаписи.ПроизводственноеПодразделение
			<> ПроизводственноеПодразделение;
			
		//++ НЕ УТКА
		
		Для каждого ИмяОпции Из ИменаОпций Цикл
			ЗначениеОпцийДоИзменения.Вставить(ИмяОпции, РеквизитыДоЗаписи[ИмяОпции]);
		КонецЦикла;
		
		//-- НЕ УТКА
		
		//++ Устарело_Производство21

		//++ НЕ УТКА
		Если УправлениеМаршрутнымиЛистами = Перечисления.УправлениеМаршрутнымиЛистами.ПооперационноеПланирование Тогда
		
			СпособДоЗаписи = РеквизитыДоЗаписи.СпособПооперационногоУправления;
			Если ЗначениеЗаполнено(СпособДоЗаписи) И НЕ СпособДоЗаписи = СпособПооперационногоУправления Тогда
				ПриИзмененииСпособаПооперационногоУправления(СпособДоЗаписи, Отказ);
			КонецЕсли;
		
		КонецЕсли;
		//-- НЕ УТКА

		//-- Устарело_Производство21

		//-- НЕ УТ
		
		ТекущаяСсылка = Ссылка;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Ссылка", ТекущаяСсылка);
	//++ НЕ УТ
	ДополнительныеСвойства.Вставить("ИзменилсяПризнакПроизводственное", ИзменилсяПризнакПроизводственное);
	ДополнительныеСвойства.Вставить("РассчитатьДлительностьПроизводства",
		НеобходимоРассчитатьДлительностьПроизводства(Отказ));
	
	//++ НЕ УТКА
	ДополнительныеСвойства.Вставить("ЗначениеОпцийДоИзменения",    ЗначениеОпцийДоИзменения);
	ДополнительныеСвойства.Вставить("ЗначениеОпцийПослеИзменения", ЗначениеОпцийПослеИзменения);
	//-- НЕ УТКА
	
	//-- НЕ УТ
	
	// Установка реквизита РеквизитДопУпорядочивания
	Если НЕ Отказ И РеквизитДопУпорядочивания = 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК Таблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания УБЫВ");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		РеквизитДопУпорядочивания = ?(Не ЗначениеЗаполнено(Выборка.РеквизитДопУпорядочивания), 1, Выборка.РеквизитДопУпорядочивания + 1);
		
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыОрганизацийПодразделений.НеДействует И Не ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ТекущаяСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОрганизацийПодразделений.Действует)
		|	И СтруктураПредприятия.Родитель = &Ссылка";
		
		Если Не Запрос.Выполнить().Пустой() Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Существуют подчиненные действующие подразделения. Статус ""не действует"" не может быть установлен.';
					|en = 'There are subordinate active business units. Cannot set the ""Inactive"" status.'"),
				,
				"Статус",
				,
				Отказ);
		КонецЕсли;     
	КонецЕсли;
	Если ЗначениеЗаполнено(Родитель) 
		И Статус = Перечисления.СтатусыОрганизацийПодразделений.Действует
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Статус") = Перечисления.СтатусыОрганизацийПодразделений.НеДействует Тогда

		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'У родительского подразделения установлен статус ""не действует"". Статус ""действует"" не может быть установлен.';
				|en = 'The parent business unit has the ""Inactive"" status. Cannot set the ""Active"" status.'"),
			,
			"Статус",
			,
			Отказ);
	КонецЕсли;
	//++ НЕ УТ
	ДобавитьПодразделениеВТЧПолитикиУчетаСерийВидовНоменклатуры(Отказ);
	ОбновитьФлагИспользованияСерий();
	//-- НЕ УТ
	
	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());	

КонецПроцедуры
